Embedfire-motor/ebf_motor_tutorial_code_stm32f407_jiaoyang/basis_part/F407/stepper—GPIO延时模拟脉冲控制/User/stepper/bsp_stepper_init.h
#ifndef __BSP_STEP_MOTOR_INIT_H
#define	__BSP_STEP_MOTOR_INIT_H

#include "stm32f4xx.h"
#include "stm32f4xx_hal.h"

//引脚定义
/*******************************************************/
//Motor 方向 
#define MOTOR_DIR_PIN                  	GPIO_PIN_13   
#define MOTOR_DIR_GPIO_PORT            	GPIOB                     
#define MOTOR_DIR_GPIO_CLK_ENABLE()   	__HAL_RCC_GPIOB_CLK_ENABLE()

////Motor 脉冲

#define MOTOR_PUL_PIN                  	GPIO_PIN_15            
#define MOTOR_PUL_GPIO_PORT            	GPIOA
#define MOTOR_PUL_GPIO_CLK_ENABLE()   	__HAL_RCC_GPIOA_CLK_ENABLE()

//Motor 使能 
#define MOTOR_EN_PIN                  	GPIO_PIN_6
#define MOTOR_EN_GPIO_PORT            	GPIOA                       
#define MOTOR_EN_GPIO_CLK_ENABLE()    	__HAL_RCC_GPIOA_CLK_ENABLE()
	
/************************************************************/
#define HIGH 1	//高电平
#define LOW 0		//低电平

#define ON 1	//开
#define OFF 0		//关

#define CLOCKWISE 			1//顺时针
#define ANTI_CLOCKWISE	0//逆时针


//控制使能引脚
/* 带参宏，可以像内联函数一样使用 */
#define MOTOR_EN(x)					HAL_GPIO_WritePin(MOTOR_EN_GPIO_PORT,MOTOR_EN_PIN,x)
#define MOTOR_PLU(x)				HAL_GPIO_WritePin(MOTOR_PUL_GPIO_PORT,MOTOR_PUL_PIN,x)
#define MOTOR_DIR(x)				HAL_GPIO_WritePin(MOTOR_DIR_GPIO_PORT,MOTOR_DIR_PIN,x)

extern void stepper_Init(void);
extern void stepper_turn(int tim,float angle,float subdivide,uint8_t dir);
#endif /* __STEP_MOTOR_INIT_H */
